# Напиши програму, яка запитує у користувача кількість елементів списку, 
# а потім дозволяє ввести самі елементи списку (це можуть бути будь-які числа). 
# Після цього програма повинна вивести на екран:

# Суму всіх елементів списку.
# Середнє значення елементів.
# Найбільший та найменший елементи списку.

# Якщо список порожній (якщо користувач ввів 0 елементів), 
# вивести повідомлення: "Список порожній".

# Приклад:
# Введіть кількість елементів списку: 5
# Введіть елемент 1: 10
# Введіть елемент 2: 20
# Введіть елемент 3: 30
# Введіть елемент 4: 40
# Введіть елемент 5: 50

# Результат:
# Сума елементів: 150
# Середнє значення: 30.0
# Найбільший елемент: 50
# Найменший елемент: 10

