
# Оскільки використання конструкції yield вказано тільки у "Рекомендаціях до завдання", але не у "Вимогах до завдання"
# чи "Критеріях до оцінювання", то мною було прийнято рішення не використовувати дану рекомендацію
# Simple is better than complex. The Zen of Python. ©
# =)

import re

def generator_numbers(text: str):            # Ф-ція приймає аргументом рядок text                
    return re.findall(r'\d*\.?\d+', text)    # Проводимо пошук всіх збігів у text за шаблоном "0 або більше цифр; одна крапка, або нічого; одна або більше цифр" та повертаємо списком як результат функції


def sum_profit(text: str, func):                # Ф-ція приймає аргументами рядок text та будь-яку ф-цію
    return sum(float(a) for a in func(text))    # Повертаємо суму всіх значень (флоат, оскільки значення можуть бути десятковими) які отримані шляхом перебору ф-ції з аргументом text

text = "Загальний дохід працівника складається з декількох частин: 1000.01 як основний дохід, доповнений додатковими надходженнями 27.45 і 324.00 доларів."
total_income = sum_profit(text, generator_numbers)
print(f"Загальний дохід: {total_income} $")
